// 强制转换

// 减（-）、乘（*）、除（/）、取余（%） 会将操作数转为数字

// 加（+）,则应用左结合律运算符:从左往右进行运算
// +
1+2+'3' = '33'
1+'2'+3 = '123'

// 位运算符，会将操作数转换为32位整数
// ~
// &
// |
// <<
// >>
// >>>

// 对象的强制转换，应用.toString()转为字符串，
//                 应用.valueOf() 转为数字
//      通过重写valueOf,toString方法验证
//      2*{valueOf:function(){return 3}} // 6
//      "s"+{toString:function(){return "s"}} // "ss"

// 真值运算
// js中会被转为false的7个假值,其他都为true：
//    false,
//    null,
//    undefined,
//    0,-0,
//    "",
//    NaN,
